{"startSite": "", "filingNum": "", "onePageListNum": 15, "commentLabelColor": "#006b75", "yearColorList": ["#bc4c00", "#0969da", "#1f883d", "#A333D0"], "i18n": "CN", "dayTheme": "light", "nightTheme": "dark", "urlMode": "pinyin", "script": "", "style": "", "title": "Denis Tu", "displayTitle": "Denis Tu", "subTitle": "CodeWizard", "homeUrl": "https://dmarshaltu.github.io/", "avatarUrl": "https://avatars.githubusercontent.com/u/59089266?v=4", "faviconUrl": "https://avatars.githubusercontent.com/u/59089266?v=4", "singlePage": [], "GMEEK_VERSION": "last", "postListJson": {"P3": {"htmlDir": "docs/post/Streamlining DevOps with Crystal: Introducing the `cWizard` CLI.html", "label": "documentation", "labelColor": "#0075ca", "postTitle": "Streamlining DevOps with Crystal: Introducing the `cWizard` CLI", "postUrl": "post/Streamlining%20DevOps%20with%20Crystal%3A%20Introducing%20the%20%60cWizard%60%20CLI.html", "postSourceUrl": "https://github.com/DmarshalTU/dmarshaltu.github.io/issues/3", "commentNum": 0, "description": "In a recent post, [\"Crystal: A Shining Choice for DevOps\"](https://medium.com/@denismarshalltumakov/crystal-a-shining-choice-for-devops-83d1e158cfe3), we explored why the `Crystal` programming language is an excellent tool for DevOps practitioners. Building on this theme, I'm excited to introduce a new project that exemplifies Crystal's strengths: the `cWizard` CLI.\r\n\r\n<img width=\"836\" alt=\"cWizard\" src=\"https://github.com/DmarshalTU/dmarshaltu.github.io/assets/59089266/46c32a9b-19da-4c79-b142-1f90928b6170\">\r\n\r\n\r\nThe `cWizard` CLI: Docker and Kubernetes Made Simpler\r\nThe `cWizard` Command Line Interface (CLI) is a testament to Crystal's capabilities in creating powerful DevOps tools. This CLI streamlines Docker and Kubernetes management, offering an interactive, menu-driven interface that simplifies complex container orchestration tasks.\r\n\r\n## Why Crystal for `cWizard` CLI?\r\n\r\nPerformance and Efficiency: Crystal's syntax is not just elegant; it's also efficient. It compiles down to fast, low-level code, making `cWizard` CLI incredibly speedy and responsive.\r\nType Safety with Ease: One of Crystal's crown jewels is its type inference system, which guarantees type safety without the overhead of repetitive type annotations. This means fewer bugs and smoother maintenance for tools like the `cWizard` CLI.\r\nDeveloper Friendliness: Crystal's Ruby-like syntax makes it approachable. Writing a CLI tool that interacts with complex systems like Docker and Kubernetes becomes less daunting and more enjoyable.\r\nFeatures of `cWizard` CLI\r\nThe `cWizard` CLI isn't just another command-line tool; it's a comprehensive solution for managing Docker and Kubernetes environments. Key features include:\r\n\r\n* `Docker Management`: List images and containers with ease.\r\n* `Kubernetes Operations`: From viewing pod logs to managing deployments and resources, all Kubernetes tasks are simplified.\r\n* `Extensibility`: Users can extend the CLI with custom plugins, thanks to Crystal's flexible nature.\r\n\r\n## A Real-World Application\r\n\r\n[Github](https://github.com/DmarshalTU/cWizard)\r\n\r\nTo demonstrate how Crystal can be leveraged in a real-world scenario, let's delve into a key functionality of the `cWizard` CLI: Kubernetes logs viewing. In traditional scenarios, viewing logs might require multiple kubectl commands. `cWizard` CLI simplifies this into a single menu choice, abstracting the complexity and streamlining the user's workflow.\r\n\r\n### Bridging the Gap\r\n\r\nOne of the challenges in the DevOps field is the gap between developing applications and managing their deployment and operation. Crystal, with its developer-friendly syntax and robust performance, bridges this gap. Tools like the `cWizard` CLI, developed in Crystal, bring complex orchestration tasks into a more manageable realm.\r\n\r\n### Future Directions\r\n\r\nAs the `cWizard` CLI project evolves, it will continue to showcase Crystal's adaptability and strength in creating DevOps tools. The project aims to constantly incorporate feedback and new ideas, embodying the dynamic and ever-evolving nature of DevOps.\r\n\r\n### Conclusion\r\n\r\nThe `cWizard` CLI is more than just a project; it's a showcase of how Crystal can revolutionize the way we approach DevOps tasks. By bringing together ease of use, performance, and extendibility, it stands as a beacon for anyone looking to explore the intersection of development and operations.\r\n\r\nAs we continue to explore Crystal's potential in the DevOps world, the `cWizard` CLI serves as a practical example of how this elegant language can lead to powerful, efficient, and enjoyable software.。", "top": 0, "createdAt": 1704696206, "style": "", "script": "", "createdDate": "2024-01-08", "dateLabelColor": "#bc4c00"}, "P4": {"htmlDir": "docs/post/OpenAI Crystal Library A Tiny Dall-E 3 UI for your homelab.html", "label": "documentation", "labelColor": "#0075ca", "postTitle": "OpenAI Crystal Library A Tiny Dall-E 3 UI for your homelab", "postUrl": "post/OpenAI%20Crystal%20Library%20A%20Tiny%20Dall-E%203%20UI%20for%20your%C2%A0homelab.html", "postSourceUrl": "https://github.com/DmarshalTU/dmarshaltu.github.io/issues/4", "commentNum": 0, "description": "![](https://miro.medium.com/v2/resize:fit:1400/format:webp/1*FpWQ8XB29XIplUJNMkAm0Q.png)\r\n\r\n\r\n[Simon Marache](https://github.com/Blizarre) [MicroDalle](https://github.com/Blizarre/microdalle.git) project suited me very well because of his use of the openai library in Python and flask, at first glance the project seemed lost because I could not find any library that allowed me to work with the chatgpt api, on the other hand I did not know in crystal any framework for building servers and worst of all I haven't written anything for more than 3 months because of reserve service and I really had no desire to go back to sitting in front of the computer and especially not writing code.\r\nBut this project gave me back my desire to explore and opened up a new horizon, to take a rich, easy-to-learn language and write the libraries and the project myself without just importing existing things, on one screen the library with the debugger and on the other side the server that is based on the same library, because I immersed myself in the crystal syntax and in the book The only one I found was \"Crystal Programming\" by George Dietrich and both projects were written as one.\r\nAnother good thing in my experience along the way is learning to work with [Kemal](https://kemalcr.com/), Lightning Fast, Super Simple web framework.\r\n\r\nGitHub [MicroDalle_cr](https://github.com/DmarshalTU/microdallecr.git)\r\n\r\nAs I wrote in the previous article about [OpenAI Crystal Library: Bridging Machine Learning and the Crystal Language](https://medium.com/@denismarshalltumakov/openai-crystal-library-bridging-machine-learning-and-the-crystal-language-f88a9536ba0b), the OpenAI Crystal Library is focused on providing a straightforward and efficient interface for integrating OpenAI's machine learning capabilities with Crystal-based applications. It's not about reinventing the wheel; it's about building solid connections between existing technologies and learn new things.\r\n\r\nThe project made me promote the library and also add the possibility of working with photos and not just as a chat, this is what came out.\r\n\r\nGitHub [OpenAI_CR](https://github.com/DmarshalTU/openai.git)\r\n\r\n```crystal\r\nrequire \"openai\"\r\n\r\nLog.setup_from_env\r\n\r\nOPENAI_KEY = \"xxxxxxxxxx\"\r\nclient = OpenAI::Client.new(OPENAI_KEY)\r\n\r\nresponse = client.create_image_completion(\"dall-e-3\", \"image description\", size, hd, 1)\r\n```\r\n\r\nin the future if this library will get to [ShardBox](https://shardbox.org/), it can be imported via dependencies:\r\n```yaml\r\ndependencies:\r\n  openai:\r\n    github: dmarshaltu/openai\r\n```\r\n\r\nThe journey has just begun and there is still a long way to go.。", "top": 0, "createdAt": 1705157375, "style": "", "script": "", "createdDate": "2024-01-13", "dateLabelColor": "#bc4c00"}}, "singeListJson": {}, "prevUrl": "disabled", "nextUrl": "disabled"}